# InternalDefinitions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalDefinitions Class
Members See Also
---
This object blocks attempts to create new internal definitions as they are not permitted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class InternalDefinitions : Definitions
```

Visual Basic
---
```text
Public Class InternalDefinitions _
	Inherits Definitions
```

Visual C++
---
```text
public ref class InternalDefinitions : public Definitions
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Definitions Autodesk.Revit.DB..::..InternalDefinitions
# See Also
InternalDefinitions Members
Autodesk.Revit.DB Namespace